[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:31:35
           id="orgCode"
           type="text"
           isInvalid={Boolean(errors.orgCode)}
-          {...register("orgCode", {
-            required: "Org Code is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("orgCode", {})}
           disabled={Boolean(initialContents)}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Org Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:76:24
           isInvalid={Boolean(errors.orgTranslation)}
           {...register("orgTranslation", {
             required: "Org Translation is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
