[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.original.orgCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/ucsborganizations/edit/ZPR' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.original.orgCode}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/ucsborganizations/edit/ZPR' ]

Received: 

  1st vi.fn() call:

  [
-   "/ucsborganizations/edit/ZPR",

[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "Org Code",
-      accessorKey: "orgCode", // accessor is the "key" in the data
-    },
-
-    {
-      header: "Org Translation Short",
-      accessorKey: "orgTranslationShort",
-    },
-    {
-      header: "Org Translation",
-      accessorKey: "orgTranslation",
-    },
-    {
-      header: "Inactive",
-      accessorKey: "inactive",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationsIndexPage tests renders three organizations correctly for regular user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:39:15
 
   const columns = [
     {
-      header: "Org Code",
+      header: "",
       accessorKey: "orgCode", // accessor is the "key" in the data
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Org Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:40:20
   const columns = [
     {
       header: "Org Code",
-      accessorKey: "orgCode", // accessor is the "key" in the data
+      accessorKey: "", // accessor is the "key" in the data
     },
 
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:47:5
       header: "Org Translation Short",
       accessorKey: "orgTranslationShort",
     },
-    {
-      header: "Org Translation",
-      accessorKey: "orgTranslation",
-    },
+    {},
     {
       header: "Inactive",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:49:20
     },
     {
       header: "Org Translation",
-      accessorKey: "orgTranslation",
+      accessorKey: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:52:15
       accessorKey: "orgTranslation",
     },
     {
-      header: "Inactive",
+      header: "",
       accessorKey: "inactive",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Inactive. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:53:20
     },
     {
       header: "Inactive",
-      accessorKey: "inactive",
+      accessorKey: "",
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
