[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsborganization) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.jsx:8:54
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsborganization) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosParams = (ucsborganization) => ({});
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.jsx:19:43
     },
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(
-      `New ucsborganization Created - orgCode: ${ucsborganization.orgCode} orgTranslation: ${ucsborganization.orgTranslation}`,
-    );
-  };
+  const onSuccess = (ucsborganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.jsx:21:7
 
   const onSuccess = (ucsborganization) => {
     toast(
-      `New ucsborganization Created - orgCode: ${ucsborganization.orgCode} orgTranslation: ${ucsborganization.orgTranslation}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New ucsborganization Created - orgCode: ZPR orgTranslation: ZETA PHI RHO",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.jsx:38:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsborganizations" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/ucsborganizations' } ]

Number of calls: 0
