[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgCode: ucsborganization.orgCode,
-    },
-    data: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: ZPR orgTranslation: ZETA PHI RHO FULL",

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (ucsborganization) => ({
     url: "/api/ucsborganizations",
-    method: "PUT",
+    method: "",
     params: {
       orgCode: ucsborganization.orgCode,
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: ZPR orgTranslation: ZETA PHI RHO FULL",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.jsx:42:43
     },
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(
-      `UCSBOrganization Updated - orgCode: ${ucsborganization.orgCode} orgTranslation: ${ucsborganization.orgTranslation}`,
-    );
-  };
+  const onSuccess = (ucsborganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {ucsborganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsborganization}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {ucsborganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsborganization}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
