[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.jsx:19:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsborganizations/all"],
-    { method: "GET", url: "/api/ucsborganizations/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: UCSBOrganizationsIndexPage tests renders three organizations correctly for regular user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.jsx:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsborganizations/all"],
-    { method: "GET", url: "/api/ucsborganizations/all" },
+    { method: "", url: "/api/ucsborganizations/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: UCSBOrganizationsIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.jsx:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsborganizations/create"
-          style={{ float: "right" }}
-        >
-          Create UCSBOrganization
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: UCSBOrganizationsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create UCSBOrganization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
