[Killed] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationsIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Organization with orgCode ZPR was deleted",
