[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:56:22
               isInvalid={Boolean(errors.itemId)}
               {...register("itemId", {
                 required: "Item Id is required.",
-                min: {
-                  value: 1,
-                  message: "Item Id must be at least 1.",
-                },
+                min: {},
               })}
             />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Item Id must be at least 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:72:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="stars">Stars</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-stars`}
+              data-testid={``}
               id="stars"
               type="number"
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-stars"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:82:22
                   value: 1,
                   message: "Stars must be at least 1.",
                 },
-                max: {
-                  value: 5,
-                  message: "Stars must be at most 5.",
-                },
+                max: {},
               })}
             />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars must be at most 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:84:28
                 },
                 max: {
                   value: 5,
-                  message: "Stars must be at most 5.",
+                  message: "",
                 },
               })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars must be at most 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:106:26
               isInvalid={Boolean(errors.reviewerEmail)}
               {...register("reviewerEmail", {
                 required: "Reviewer Email is required.",
-                pattern: {
-                  value: emailRegex,
-                  message: "Reviewer Email must be a valid email address.",
-                },
+                pattern: {},
               })}
             />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Reviewer Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:122:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="dateReviewed">Date Reviewed</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-dateReviewed`}
+              data-testid={``}
               id="dateReviewed"
               type="datetime-local"

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:126:44
               id="dateReviewed"
               type="datetime-local"
               isInvalid={Boolean(errors.dateReviewed)}
-              {...register("dateReviewed", {
-                required: "Date Reviewed is required.",
-                pattern: {
-                  value: isodateRegex,
-                  message: "Date Reviewed must be in ISO format.",
-                },
-              })}
+              {...register("dateReviewed", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:128:26
               isInvalid={Boolean(errors.dateReviewed)}
               {...register("dateReviewed", {
                 required: "Date Reviewed is required.",
-                pattern: {
-                  value: isodateRegex,
-                  message: "Date Reviewed must be in ISO format.",
-                },
+                pattern: {},
               })}
             />

[Survived] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:130:28
                 required: "Date Reviewed is required.",
                 pattern: {
                   value: isodateRegex,
-                  message: "Date Reviewed must be in ISO format.",
+                  message: "",
                 },
               })}
