[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:43:20
     },
     {
       header: "Item Id",
-      accessorKey: "itemId",
+      accessorKey: "",
     },
     {
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:55:20
     },
     {
       header: "Date Reviewed",
-      accessorKey: "dateReviewed",
+      accessorKey: "",
     },
     {
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-dateReviewed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
