[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (review) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:9:10
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
   const objectToAxiosParams = (review) => ({
-    url: "/api/menuitemreview/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New MenuItemReview Created - id: 7",

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:20:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(`New MenuItemReview Created - id: ${review.id}`);
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:21:11
   });
 
   const onSuccess = (review) => {
-    toast(`New MenuItemReview Created - id: ${review.id}`);
+    toast(``);
   };
 
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New MenuItemReview Created - id: 7",
