[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: "/api/menuitemreview",
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (review) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: review.id,
-    },
-    data: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'MenuItemReview Updated - id: 17' ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 17",

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:28:47
     },
   );
 
-  const objectToAxiosPutParams = (review) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: review.id,
-    },
-    data: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosPutParams = (review) => ({});
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'MenuItemReview Updated - id: 17' ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 17",

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (review) => ({
-    url: "/api/menuitemreview",
+    url: "",
     method: "PUT",
     params: {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'MenuItemReview Updated - id: 17' ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 17",

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:31:13
   const objectToAxiosPutParams = (review) => ({
     url: "/api/menuitemreview",
     method: "PUT",
-    params: {
-      id: review.id,
-    },
+    params: {},
     data: {
       itemId: review.itemId,
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 17 }

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:43:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(`MenuItemReview Updated - id: ${review.id}`);
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {review && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={review}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {review && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={review}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
