[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:61:5
       header: "Date Needed",
       accessorKey: "dateNeeded",
     },
-    {
-      header: "Done",
-      accessorKey: "done",
-      // Stryker disable next-line all
-      cell: ({ cell }) => (cell.getValue() ? "true" : "false"),
-    },
+    {},
   ];
 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
