[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:21:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New RecommendationRequest Created - id: ${recommendationRequest.id}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
