[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:21:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: "/api/recommendationrequests",
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={recommendationRequest}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={recommendationRequest}
-          />
-        )}
+        {recommendationRequest || <RecommendationRequestForm submitAction={onSubmit} buttonLabel="Update" initialContents={recommendationRequest} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
