[Killed] MethodExpression
main/components/Articles/ArticlesForm.jsx:13:20
   const defaultValues = initialContents
     ? {
         ...initialContents,
-        dateAdded: initialContents.dateAdded?.slice(0, 16),
+        dateAdded: initialContents.dateAdded,
       }
     : undefined;
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(2024-01-02T03:04)

Expected the element to have value:
  2024-01-02T03:04
Received:
  2024-01-02T03:04:05.000

[Killed] OptionalChaining
main/components/Articles/ArticlesForm.jsx:13:20
   const defaultValues = initialContents
     ? {
         ...initialContents,
-        dateAdded: initialContents.dateAdded?.slice(0, 16),
+        dateAdded: initialContents.dateAdded.slice(0, 16),
       }
     : undefined;
killedBy: ArticlesForm tests renders correctly when initialContents is missing dateAdded
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:56:33
           id="title"
           type="text"
           isInvalid={Boolean(errors.title)}
-          {...register("title", {
-            required: "Title is required.",
-            maxLength: {
-              value: 255,
-              message: "Title must be 255 characters or fewer.",
-            },
-          })}
+          {...register("title", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:72:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="url">URL</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-url"}
+          data-testid={testIdPrefix + ""}
           id="url"
           type="url"
killedBy: ArticlesForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-url"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:76:31
           id="url"
           type="url"
           isInvalid={Boolean(errors.url)}
-          {...register("url", {
-            required: "URL is required.",
-            validate: (value) => {
-              try {
-                new URL(value);
-                return true;
-              } catch {
-                return "URL must be valid.";
-              }
-            },
-          })}
+          {...register("url", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /URL is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/Articles/ArticlesForm.jsx:78:34
           isInvalid={Boolean(errors.url)}
           {...register("url", {
             required: "URL is required.",
-            validate: (value) => {
-              try {
-                new URL(value);
-                return true;
-              } catch {
-                return "URL must be valid.";
-              }
-            },
+            validate: (value) => {},
           })}
         />
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /URL must be valid/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/Articles/ArticlesForm.jsx:79:19
           {...register("url", {
             required: "URL is required.",
             validate: (value) => {
-              try {
-                new URL(value);
-                return true;
-              } catch {
+              try {} catch {
                 return "URL must be valid.";
               }
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /URL must be valid/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.jsx:81:24
             validate: (value) => {
               try {
                 new URL(value);
-                return true;
+                return false;
               } catch {
                 return "URL must be valid.";
killedBy: ArticlesForm tests submits correctly with valid input
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BlockStatement
main/components/Articles/ArticlesForm.jsx:82:23
               try {
                 new URL(value);
                 return true;
-              } catch {
-                return "URL must be valid.";
-              }
+              } catch {}
             },
           })}
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /URL must be valid/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:97:39
         <Form.Label htmlFor="explanation">Explanation</Form.Label>
         <Form.Control
           as="textarea"
-          data-testid={testIdPrefix + "-explanation"}
+          data-testid={testIdPrefix + ""}
           id="explanation"
           rows={3}
killedBy: ArticlesForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-explanation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:105:24
             required: "Explanation is required.",
             maxLength: {
               value: 255,
-              message: "Explanation must be 255 characters or fewer.",
+              message: "",
             },
           })}
killedBy: ArticlesForm tests that max length validations are performed
statusReason: Unable to find an element with the text: /Explanation must be 255 characters or fewer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:123:22
           isInvalid={Boolean(errors.email)}
           {...register("email", {
             required: "Email is required.",
-            pattern: {
-              value: emailRegex,
-              message: "Email must be valid.",
-            },
+            pattern: {},
           })}
         />
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Email must be valid/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:125:24
             required: "Email is required.",
             pattern: {
               value: emailRegex,
-              message: "Email must be valid.",
+              message: "",
             },
           })}
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Email must be valid/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
