[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:91:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="requestTime">Request Time (ISO format)</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-requestTime"}
+          data-testid={testIdPrefix + ""}
           id="requestTime"
           type="datetime-local"
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:95:39
           id="requestTime"
           type="datetime-local"
           isInvalid={Boolean(errors.requestTime)}
-          {...register("requestTime", {
-            required: "Request Time is required.",
-          })}
+          {...register("requestTime", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
