[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:49:5
       header: "Team Id",
       accessorKey: "teamId",
     },
-    {
-      header: "Table or Breakout Room",
-      accessorKey: "tableOrBreakoutRoom",
-    },
+    {},
     {
       header: "Request Time",
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
