[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:27:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={`${testIdPrefix}-id`}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:27:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={`${testIdPrefix}-id`}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={`${testIdPrefix}-id`} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:44:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="requesterEmail">Requester Email</Form.Label>
         <Form.Control
-          data-testid={`${testIdPrefix}-requesterEmail`}
+          data-testid={``}
           id="requesterEmail"
           type="email"
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:64:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="professorEmail">Professor Email</Form.Label>
         <Form.Control
-          data-testid={`${testIdPrefix}-professorEmail`}
+          data-testid={``}
           id="professorEmail"
           type="email"
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-professorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:70:22
           isInvalid={Boolean(errors.professorEmail)}
           {...register("professorEmail", {
             required: "Professor Email is required.",
-            pattern: {
-              value: emailRegex,
-              message: "Professor Email must be a valid email address.",
-            },
+            pattern: {},
           })}
         />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Professor Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
