[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/Articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Articles/ArticlesCreatePage.jsx:9:10
 
 export default function ArticlesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (article) => ({
-    url: "/api/Articles/post",
+    url: "",
     method: "POST",
     params: {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New article Created - id: 3 title: Ocean Cleanup Milestone",
