[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/Articles?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: "/api/Articles",
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: "/api/Articles",
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/Articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Article Updated - id: 17 title: Updated Article",

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:28:48
     },
   );
 
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/Articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosPutParams = (article) => ({});
 
   const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Article Updated - id: 17 title: Updated Article",

[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (article) => ({
     url: "/api/Articles",
-    method: "PUT",
+    method: "",
     params: {
       id: article.id,
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Article Updated - id: 17 title: Updated Article",

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={article}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={article}
-          />
-        )}
+        {article || <ArticlesForm submitAction={onSubmit} buttonLabel="Update" initialContents={article} />}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
