[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:23:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/ucsbdiningcommonsmenuitems`,
+      url: ``,
       params: {
         id,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonsMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonsMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItem.name,
-      station: ucsbDiningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Pasta",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:66
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonsMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonsMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItem.name,
-      station: ucsbDiningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({});
 
   const onSuccess = (ucsbDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Pasta",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:31:10
   );
 
   const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Pasta",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:32:13
 
   const objectToAxiosPutParams = (ucsbDiningCommonsMenuItem) => ({
     url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
+    method: "",
     params: {
       id: ucsbDiningCommonsMenuItem.id,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Pasta",

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {ucsbDiningCommonsMenuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbDiningCommonsMenuItem}
-          />
-        )}
+        {ucsbDiningCommonsMenuItem || <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbDiningCommonsMenuItem} />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
