[Killed] BlockStatement
src/main/utils/articlesUtils.js:10:47
 }
 // Stryker restore all
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    // Stryker disable next-line all
-    url: "/api/Articles",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: ArticlesTable tests delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
src/main/utils/articlesUtils.js:14:13
   return {
     // Stryker disable next-line all
     url: "/api/Articles",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.original.id,
killedBy: ArticlesTable tests delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
