[Killed] BlockStatement
src/main/utils/helpRequestUtils.js:10:47
 }
 // Stryker restore all
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    // Stryker disable next-line all
-    url: "/api/helprequests",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: HelpRequestTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
src/main/utils/helpRequestUtils.js:11:10
 // Stryker restore all
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    // Stryker disable next-line all
-    url: "/api/helprequests",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
+  return {};
 }
 
killedBy: HelpRequestTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
